spec/fixtures/vcr_cassettes/conekta_limit_exceeded_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.conekta.io/charges
    body:
      encoding: UTF-8
      string: '{"amount":200000,"reference_id":"R071224764-QPYXWEZA","currency":"MXN","description":"R071224764-QPYXWEZA","card":"tok_PQQgZnLujnTW1BD1r"}'
    headers:
      Accept:
      - ' application/vnd.conekta-v0.3.0+json'
      Content-type:
      - ' application/json'
      Authorization:
      - Basic MXR2NXlKcDN4blZaN2VLNjdtNGg6
      User-Agent:
      - Faraday v0.8.9
  response:
    status:
      code: 402
      message: 
    headers:
      Cache-Control:
      - no-cache
      Conekta-Media-Type:
      - conekta-v0.3.0; format=json
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Wed, 29 Jan 2014 16:07:57 GMT
      Server:
      - nginx/1.1.19
      Status:
      - 402 Payment Required
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - fba023030017706faa7d20e2ec209f75
      X-Runtime:
      - '1.712457'
      Content-Length:
      - '91'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"object":"error","type":"processing_error","message":"The payment
        could not be processed"}'
    http_version: 
  recorded_at: Wed, 29 Jan 2014 16:07:42 GMT
recorded_with: VCR 2.8.0
